fullstack/sugarcrm/centiro/Authenticate.xml

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="SharedOperations" targetNamespace="http://centiro.com/facade/shared/1/0/servicecontract"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
                  xmlns:wsa10="http://www.w3.org/2005/08/addressing"
                  xmlns:tns="http://centiro.com/facade/shared/1/0/servicecontract"
                  xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
                  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
                  xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
                  xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
                  xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <wsdl:types>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified"
                   targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
            <xs:element name="anyType" nillable="true" type="xs:anyType"/>
            <xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
            <xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
            <xs:element name="boolean" nillable="true" type="xs:boolean"/>
            <xs:element name="byte" nillable="true" type="xs:byte"/>
            <xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
            <xs:element name="decimal" nillable="true" type="xs:decimal"/>
            <xs:element name="double" nillable="true" type="xs:double"/>
            <xs:element name="float" nillable="true" type="xs:float"/>
            <xs:element name="int" nillable="true" type="xs:int"/>
            <xs:element name="long" nillable="true" type="xs:long"/>
            <xs:element name="QName" nillable="true" type="xs:QName"/>
            <xs:element name="short" nillable="true" type="xs:short"/>
            <xs:element name="string" nillable="true" type="xs:string"/>
            <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
            <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
            <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
            <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
            <xs:element name="char" nillable="true" type="tns:char"/>
            <xs:simpleType name="char">
                <xs:restriction base="xs:int"/>
            </xs:simpleType>
            <xs:element name="duration" nillable="true" type="tns:duration"/>
            <xs:simpleType name="duration">
                <xs:restriction base="xs:duration">
                    <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
                    <xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
                    <xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:element name="guid" nillable="true" type="tns:guid"/>
            <xs:simpleType name="guid">
                <xs:restriction base="xs:string">
                    <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:attribute name="FactoryType" type="xs:QName"/>
            <xs:attribute name="Id" type="xs:ID"/>
            <xs:attribute name="Ref" type="xs:IDREF"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified"
                   targetNamespace="http://schemas.datacontract.org/2004/07/Centiro.Facade.Common.Operations.Authenticate"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   xmlns:tns="http://schemas.datacontract.org/2004/07/Centiro.Facade.Common.Operations.Authenticate">
            <xs:complexType name="AuthenticateRequest">
                <xs:sequence>
                    <xs:element name="Password" nillable="true" type="xs:string"/>
                    <xs:element name="UserName" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:element name="AuthenticateRequest" nillable="true" type="tns:AuthenticateRequest"/>
            <xs:complexType name="AuthenticateResponse">
                <xs:sequence>
                    <xs:element minOccurs="0" name="AuthenticationTicket" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:element name="AuthenticateResponse" nillable="true" type="tns:AuthenticateResponse"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified" targetNamespace="http://centiro.com/facade/shared/1/0/servicecontract"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema">
            <xs:import
                    namespace="http://schemas.datacontract.org/2004/07/Centiro.Facade.Common.Operations.Authenticate"/>
            <xs:element name="AuthenticateRequest" nillable="true" type="q1:AuthenticateRequest"
                        xmlns:q1="http://schemas.datacontract.org/2004/07/Centiro.Facade.Common.Operations.Authenticate"/>
            <xs:element name="AuthenticateResponse" nillable="true" type="q2:AuthenticateResponse"
                        xmlns:q2="http://schemas.datacontract.org/2004/07/Centiro.Facade.Common.Operations.Authenticate"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified" targetNamespace="http://centiro.com/facade/shared/1/0/datacontract"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   xmlns:tns="http://centiro.com/facade/shared/1/0/datacontract">
            <xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
            <xs:element name="MessageId" nillable="true" type="xs:string"/>
            <xs:element name="ErrorMessages" nillable="true" type="q1:ArrayOfstring"
                        xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
            <xs:element name="Success" type="xs:boolean"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified"
                   targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
            <xs:complexType name="ArrayOfstring">
                <xs:sequence>
                    <xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="AuthenticateRequestMessage">
        <wsdl:part name="AuthenticateRequest" element="tns:AuthenticateRequest"/>
    </wsdl:message>
    <wsdl:message name="AuthenticateRequestMessage_Headers">
        <wsdl:part name="MessageId" element="q1:MessageId"
                   xmlns:q1="http://centiro.com/facade/shared/1/0/datacontract"/>
    </wsdl:message>
    <wsdl:message name="AuthenticateResponseMessage">
        <wsdl:part name="AuthenticateResponse" element="tns:AuthenticateResponse"/>
    </wsdl:message>
    <wsdl:message name="AuthenticateResponseMessage_Headers">
        <wsdl:part name="ErrorMessages" element="q2:ErrorMessages"
                   xmlns:q2="http://centiro.com/facade/shared/1/0/datacontract"/>
        <wsdl:part name="Success" element="q3:Success" xmlns:q3="http://centiro.com/facade/shared/1/0/datacontract"/>
    </wsdl:message>
    <wsdl:portType name="ISharedOperations">
        <wsdl:operation name="Authenticate">
            <wsdl:input
                    wsam:Action="http://centiro.com/facade/shared/1/0/servicecontract/ISharedOperations/Authenticate"
                    name="AuthenticateRequestMessage" message="tns:AuthenticateRequestMessage"/>
            <wsdl:output
                    wsam:Action="http://centiro.com/facade/shared/1/0/servicecontract/ISharedOperations/AuthenticateResponse"
                    name="AuthenticateResponseMessage" message="tns:AuthenticateResponseMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="BasicHttpBinding_ISharedOperations" type="tns:ISharedOperations">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="Authenticate">
            <soap:operation
                    soapAction="http://centiro.com/facade/shared/1/0/servicecontract/ISharedOperations/Authenticate"
                    style="document"/>
            <wsdl:input name="AuthenticateRequestMessage">
                <soap:header message="tns:AuthenticateRequestMessage_Headers" part="MessageId" use="literal"/>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output name="AuthenticateResponseMessage">
                <soap:header message="tns:AuthenticateResponseMessage_Headers" part="ErrorMessages" use="literal"/>
                <soap:header message="tns:AuthenticateResponseMessage_Headers" part="Success" use="literal"/>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SharedOperations">
        <wsdl:port name="BasicHttpBinding_ISharedOperations" binding="tns:BasicHttpBinding_ISharedOperations">
            <soap:address
                    location="https://uat.centiro.com/Universe.Services/TMSBasic/Wcf/c1/i1/TMSBasic/Authenticate.svc/xml"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>